In [1]:
import pandas as pd 
import numpy as np

In [2]:
movies = pd.read_csv("imdb_1000.csv")

In [3]:
movies.head(4)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."

# 1. From the movies data frame.
## a. Count the missing values in the 'content_rating' column.

In [4]:
movies[movies.content_rating.isnull()].count().sum()

15

# b. Return the rows containing any missing values, how many are they?

In [49]:
movies.isnull().head()

   star_rating  title  content_rating  genre  duration  actors_list
0        False  False           False  False     False        False
1        False  False           False  False     False        False
2        False  False           False  False     False        False
3        False  False           False  False     False        False
4        False  False           False  False     False        False

In [50]:
movies.isnull().count().sum()

5874

# # c. Return the unique values in the 'content_rating' column

In [39]:
movies["content_rating"].unique()

array(['R', 'PG-13', 'NOT RATED', 'PG', 'UNRATED', 'APPROVED', 'PASSED',
       'G', 'X', nan, 'TV-MA', 'GP', 'NC-17'], dtype=object)

In [43]:
movies[movies.star_rating.isnull()].title

Series([], Name: title, dtype: object)

# d. Return the movies that are not rated and what is there number.

In [65]:
movies[movies.star_rating < 1].title

Series([], Name: title, dtype: object)

In [64]:
movies[movies.star_rating < 1].title.count()

0

# e. Return the movies with a higher rating than 9. How many are they?

In [58]:
movies[movies.star_rating > 9].title

0    The Shawshank Redemption
1               The Godfather
2      The Godfather: Part II
Name: title, dtype: object

In [59]:
movies[movies.star_rating > 9].title.count()

3

In [26]:
drinks.sort_index(by='total_litres_of_pure_alcohol').tail(1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
15,Belarus,142,373,42,14.4,Europe

# 2. Which country has the highest sum of beer_servings and spirit_servings.

In [20]:
drinks = pd.read_csv("drinks.csv")

In [21]:
drinks[drinks.beer_servings==drinks.beer_servings.max()].country

117    Namibia
Name: country, dtype: object

In [22]:
drinks[drinks.spirit_servings==drinks.spirit_servings.max()].country

68    Grenada
Name: country, dtype: object

# 3. Which continent has more beer servings, beer_servings spirit_servings wine_servings.

In [23]:
drinks[drinks.beer_servings==drinks.beer_servings.max()].continent

117    Africa
Name: continent, dtype: object

In [24]:
drinks[drinks.spirit_servings==drinks.spirit_servings.max()].continent

68    North America
Name: continent, dtype: object

In [25]:
drinks[drinks.wine_servings==drinks.wine_servings.max()].continent

61    Europe
Name: continent, dtype: object

In [26]:
drinks[drinks.continent=='Africa'].beer_servings.mean()

61.471698113207545

# #4. From every continent find the country with the highest beer_servings, spirit_servings,wine_servings.

In [27]:
drinks.groupby('continent').max()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,,
Africa,Zimbabwe,376,152,233,9.1
Asia,Yemen,247,326,123,11.5
Europe,United Kingdom,361,373,370,14.4
North America,USA,285,438,100,11.9
Oceania,Vanuatu,306,254,212,10.4
South America,Venezuela,333,302,221,8.3

# 5. In West Africa which country has the lowest total liters of alcohol?

# 6. In East Africa which country has the highest intake of alcohol?

In [ ]:
drinks[drinks.continent=='Africa'].beer_servings.mean()

In [32]:
drinks.nlargest(1, ['total_litres_of_pure_alcohol'])

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
15,Belarus,142,373,42,14.4,Europe

In [34]:
drinks.head(3)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa

In [71]:
titanic = pd.read_csv("titanic_train.csv")

In [72]:
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

# 7. From the titanic data-set what is the average age of the survivors, what was the most common Pclass and Sex.

In [78]:
titanic.groupby('Age').Survived.mean()

Age
0.42     1.000000
0.67     1.000000
0.75     1.000000
0.83     1.000000
0.92     1.000000
1.00     0.714286
2.00     0.300000
3.00     0.833333
4.00     0.700000
5.00     1.000000
6.00     0.666667
7.00     0.333333
8.00     0.500000
9.00     0.250000
10.00    0.000000
11.00    0.250000
12.00    1.000000
13.00    1.000000
14.00    0.500000
14.50    0.000000
15.00    0.800000
16.00    0.352941
17.00    0.461538
18.00    0.346154
19.00    0.360000
20.00    0.200000
20.50    0.000000
21.00    0.208333
22.00    0.407407
23.00    0.333333
           ...
44.00    0.333333
45.00    0.416667
45.50    0.000000
46.00    0.000000
47.00    0.111111
48.00    0.666667
49.00    0.666667
50.00    0.500000
51.00    0.285714
52.00    0.500000
53.00    1.000000
54.00    0.375000
55.00    0.500000
55.50    0.000000
56.00    0.500000
57.00    0.000000
58.00    0.600000
59.00    0.000000
60.00    0.500000
61.00    0.000000
62.00    0.500000
63.00    1.000000
64.00    0.000000
65.00    0.000000
66.00    0.000000
70.00    0.000000
70.50    0.000000
71.00    0.000000
74.00    0.000000
80.00    1.000000
Name: Survived, Length: 88, dtype: float64

# what was the most common Pclass and Sex.

In [87]:
table = pd.crosstab(titanic['Sex'], titanic['Pclass'])

In [88]:
table

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

# 8. Which sex recorded the most survivors according to the titanic data-set?

In [95]:
titanic.groupby('Sex').Survived.count()

Sex
female    314
male      577
Name: Survived, dtype: int64

# 11. From the UFO data-set what is the overall memory usage? Which column has the highest share of memory? How can u reduce the memory usage of some of the columns for this data set? How much have you reduced the memory usage for the data-frame? Explain your findings with code.

In [5]:
ufo = pd.read_csv('ufo.csv')

In [6]:
ufo.head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

# From the UFO data-set what is the overall memory usage?

In [7]:
ufo.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
City               18216 non-null object
Colors Reported    2882 non-null object
Shape Reported     15597 non-null object
State              18241 non-null object
Time               18241 non-null object
dtypes: object(5)
memory usage: 5.1 MB

In [9]:
ufo.memory_usage(deep=True)

Index                   80
City               1205618
Colors Reported     671313
Shape Reported     1065230
State              1076219
Time               1307165
dtype: int64

# Which column has the highest share of memory?

In [16]:
ufo.memory_usage(deep=True)

City               1205618
Colors Reported     671313
Shape Reported     1065230
State              1076219
Time               1307165
dtype: int64

# How can u reduce the memory usage of some of the columns for this data set?

In [17]:
type(ufo.memory_usage(deep=True))

pandas.core.series.Series

In [18]:
ufo.memory_usage(deep=True).sum()

5325625

In [19]:
ufo.head(2)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

In [20]:
ufo.State.head(3)

0    NY
1    NJ
2    CO
Name: State, dtype: object

In [24]:
sorted(ufo.State.unique())

['AK',
 'AL',
 'AR',
 'AZ',
 'CA',
 'CO',
 'CT',
 'Ca',
 'DE',
 'FL',
 'Fl',
 'GA',
 'HI',
 'IA',
 'ID',
 'IL',
 'IN',
 'KS',
 'KY',
 'LA',
 'MA',
 'MD',
 'ME',
 'MI',
 'MN',
 'MO',
 'MS',
 'MT',
 'NC',
 'ND',
 'NE',
 'NH',
 'NJ',
 'NM',
 'NV',
 'NY',
 'OH',
 'OK',
 'OR',
 'PA',
 'RI',
 'SC',
 'SD',
 'TN',
 'TX',
 'UT',
 'VA',
 'VT',
 'WA',
 'WI',
 'WV',
 'WY']

In [25]:
ufo.State.head(3)

0    NY
1    NJ
2    CO
Name: State, dtype: object

In [26]:
ufo['State'] = ufo.State.astype('category')

In [27]:
ufo.dtypes

City                 object
Colors Reported      object
Shape Reported       object
State              category
Time                 object
dtype: object

In [28]:
ufo.State.head(3)

0    NY
1    NJ
2    CO
Name: State, dtype: category
Categories (52, object): [AK, AL, AR, AZ, ..., WA, WI, WV, WY]

In [29]:
ufo.State.cat.codes.head()

0    35
1    32
2     5
3    17
4    35
dtype: int8

In [30]:
ufo.memory_usage(deep=True)

Index                   80
City               1205618
Colors Reported     671313
Shape Reported     1065230
State                23869
Time               1307165
dtype: int64

In [31]:
ufo.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
City               18216 non-null object
Colors Reported    2882 non-null object
Shape Reported     15597 non-null object
State              18241 non-null category
Time               18241 non-null object
dtypes: category(1), object(4)
memory usage: 4.1 MB

# How much have you reduced the memory usage for the data-frame?

In [32]:
ufo.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
City               18216 non-null object
Colors Reported    2882 non-null object
Shape Reported     15597 non-null object
State              18241 non-null category
Time               18241 non-null object
dtypes: category(1), object(4)
memory usage: 4.1 MB

In [33]:
ufo.memory_usage(deep=True)

Index                   80
City               1205618
Colors Reported     671313
Shape Reported     1065230
State                23869
Time               1307165
dtype: int64

# Explain your findings with code.

In [34]:
# to reduce memory.there was many unique values in State column.so i have to replace strings with digitals to save space
# before this conversion, it was 1076219 bytes now it's 23869 bytes

# 15. From the dataset “daily-total-female-births.csv” which month , day of the week, day of the month and number of day of the year has the highest number of births?

In [35]:
births = pd.read_csv('daily-total-female-births.csv')

In [40]:
births['Date'] = births['Date'].apply(pd.to_datetime)

In [50]:
births['month'] = births.Date.dt.month

In [53]:
births['dayoftheweek'] = births.Date.dt.weekday_name

In [56]:
births['DayOfYear'] = births.Date.dt.dayofyear

In [62]:
births['Hour'] = births.Date.dt.hour

In [67]:
births.nlargest(1, ['Births'])

,Date,Births,month,Month,dayoftheweek,DayOfYear,monthname,Hour
265,1959-09-23,73,9,9,Wednesday,266,<bound method PandasDelegate._add_delegate_acc...,0